from numpy import *
import pylab

t = str('Страх — как огонь. Так говорил один тренер по боксу.'
        ' Если уметь обращаться с огнём, то можно согреться и приготовить пищу, а во тьме сможешь осветить себе путь. '
        'Но если ты однажды потеряешь над ним контроль, он обожжёт тебя, а может и убить. '
        'Страх может быть как твоим врагом, так и союзником.')
def count_sign():
    s = ["—", "!", ".", ",", "?", "..."]
    for i in range(0, len(s)):
        x = [s[i]]
        y = [t.count(s[i])]
        pylab.bar(x, y)
    pylab.show()
count_sign()
